src/Catalogs/пэмМетрики/пэмМетрики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>пэмМетрики</name>
  <predefined>
    <items>
      <name>pde_last_refresh</name>
    </items>
    <items>
      <name>pde_scrape_duration</name>
    </items>
  </predefined>
  <attributes>
    <name>ТипМетрики</name>
    <type>
      <types>EnumRef.пэмТипыМетрик</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодПолученияМетрики</name>
    <type>
      <types>EnumRef.пэмМетодыПолученияМетрик</types>
    </type>
  </attributes>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Алгоритм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламента</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыАлгоритма</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/пэмМетрики/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Формирует структуру параметров алгоритма метрики.
//
// Параметры:
//	Ссылка - СправочникСсылка.пэмМетрики - метрика.
//
// Возвращаемое значение:
//	Структура - содержит параметры алгоритма метрики.
Функция ПараметрыАлгоритмаМетрики(Ссылка) Экспорт
	
	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.ИмяПараметра КАК ИмяПараметра,
	|	Т.Значение КАК Значение
	|ИЗ
	|	Справочник.пэмМетрики.ПараметрыАлгоритма КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗаписей   = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаЗаписей.Следующий() Цикл
		Результат.Вставить(ВыборкаЗаписей.ИмяПараметра, ВыборкаЗаписей.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
